{
  "irVersion": "1.0",
  "project": "go-financialmodelingprep",
  "repository": "https://github.com/grokify/go-financialmodelingprep",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.2.1",
      "date": "2026-03-09",
      "changed": [
        { "description": "Apply `gofmt` formatting to example files" }
      ],
      "dependencies": [
        { "description": "Bump `github.com/grokify/mogo` from 0.64.9 to 0.64.11", "commit": "0778b5e" },
        { "description": "Bump `golang.org/x/oauth2` from 0.22.0 to 0.24.0", "commit": "31ac8f3" },
        { "description": "Update `go mod` dependencies", "commit": "fec4012" }
      ],
      "build": [
        { "description": "Update to shared CI pipelines", "commit": "166e8d5" },
        { "description": "Add `.golangci.yaml` config file", "commit": "f2de7ca" },
        { "description": "Fix linting issues in `income_statement.go`", "commit": "944b422" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2024-09-02",
      "highlights": [
        { "description": "Native Go client with `Client{}`, `NewClient()`, and `GetIncomeStatement()` for direct API access" }
      ],
      "added": [
        { "description": "Native `Client{}` type with `NewClient()` constructor", "commit": "5c78208" },
        { "description": "`Client.GetIncomeStatement()` method for fetching income statements", "commit": "5c78208" },
        { "description": "`IncomeStatementParse()` function for parsing API responses", "commit": "444bb48" },
        { "description": "`IncomeStatements.RevenueTimeSeries()` method", "commit": "444bb48" },
        { "description": "`IncomeStatements.Periods()` method", "commit": "444bb48" },
        { "description": "API constants for endpoints and parameters", "commit": "70472f5" },
        { "description": "`examples/income_statement_get` example application", "commit": "1deb1d4" }
      ],
      "dependencies": [
        { "description": "Bump `github.com/grokify/mogo` from 0.63.5 to 0.64.9", "commit": "bc1e3e4" },
        { "description": "Bump `golang.org/x/oauth2` from 0.19.0 to 0.22.0", "commit": "60fe9c1" },
        { "description": "Bump `github.com/grokify/gocharts/v2` from 2.18.5 to 2.18.6", "commit": "ee1e82a" },
        { "description": "Bump `golangci/golangci-lint-action` from 5 to 6", "commit": "26936cf" }
      ],
      "build": [
        { "description": "Update Go test versions in CI", "commit": "bf1ceef" }
      ]
    },
    {
      "version": "v0.1.4",
      "date": "2024-03-18",
      "dependencies": [
        { "description": "Bump `github.com/grokify/mogo` from 0.60.0 to 0.63.5", "commit": "9d3765f" },
        { "description": "Bump `golang.org/x/oauth2` from 0.14.0 to 0.18.0", "commit": "0adf77e" },
        { "description": "Bump `github.com/grokify/gocharts/v2` from 2.15.2 to 2.18.2", "commit": "cfb81b0" },
        { "description": "Bump `golangci/golangci-lint-action` from 3 to 4", "commit": "60bc0f8" },
        { "description": "Bump `actions/setup-go` from 4 to 5", "commit": "6b95be5" }
      ],
      "build": [
        { "description": "Update Go test versions in CI", "commit": "16c1a17" },
        { "description": "Update Go mod versions", "commit": "5fb31d4" }
      ],
      "documentation": [
        { "description": "Update license years", "commit": "1cf184b" }
      ]
    },
    {
      "version": "v0.1.3",
      "date": "2023-10-29",
      "dependencies": [
        { "description": "Bump `github.com/grokify/mogo` from 0.56.0 to 0.59.0", "commit": "f7fd655" },
        { "description": "Bump `golang.org/x/oauth2` from 0.12.0 to 0.13.0", "commit": "70fd8e0" },
        { "description": "Bump `github.com/grokify/gocharts/v2` from 2.12.0 to 2.15.1", "commit": "07c7a67" },
        { "description": "Bump `actions/checkout` from 3 to 4", "commit": "32a8779" }
      ]
    },
    {
      "version": "v0.1.2",
      "date": "2023-08-12",
      "changed": [
        { "description": "Update OpenAPI spec", "commit": "41faaa7" }
      ],
      "dependencies": [
        { "description": "Bump `github.com/grokify/mogo` from 0.50.0 to 0.55.0", "commit": "53b5051" },
        { "description": "Bump `golang.org/x/oauth2` from 0.4.0 to 0.11.0", "commit": "4a2ef64" },
        { "description": "Bump `github.com/grokify/gocharts/v2` from 2.9.0 to 2.12.0", "commit": "82eab08" },
        { "description": "Bump `actions/setup-go` from 3 to 4", "commit": "8cc0c30" }
      ],
      "build": [
        { "description": "Update golangci GH action", "commit": "7e7ab6b" }
      ]
    },
    {
      "version": "v0.1.1",
      "date": "2023-01-14",
      "dependencies": [
        { "description": "Update `go mod` dependencies", "commit": "b79265e" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2022-11-14",
      "highlights": [
        { "description": "Initial release with OpenAPI-generated client for Financial Modeling Prep API" }
      ],
      "added": [
        { "description": "OpenAPI-generated Go client for FMP API", "commit": "9fa6d8c" },
        { "description": "`examples/income_statement_charts` example application for generating charts", "commit": "c2d1a02" },
        { "description": "GitHub Actions CI pipelines", "commit": "9207a30" },
        { "description": "golangci-lint configuration", "commit": "dea2d2c" },
        { "description": "Dependabot configuration for automated dependency updates", "commit": "0e27866" }
      ],
      "documentation": [
        { "description": "Initial README with badges and usage instructions", "commit": "35ee9c4" }
      ]
    }
  ]
}
